In [15]:
import pandas as pd

In [16]:
DMClass = [
    ["Andrew", "Philip", "Laura", "Julian"],
    [18, 23, 21, 20],
    [7, 6, 7, 7],
    [1, 1, 0, 1],
]

In [17]:
df = pd.DataFrame(DMClass)

In [18]:
df = df.transpose()
df.columns = [
    "Name",
    "Age",
    "Semester",
    "Sex",
]
df

     Name Age Semester Sex
0  Andrew  18        7   1
1  Philip  23        6   1
2   Laura  21        7   0
3  Julian  20        7   1

In [20]:
df.shape

(4, 4)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      object
 2   Semester  4 non-null      object
 3   Sex       4 non-null      object
dtypes: object(4)
memory usage: 260.0+ bytes

In [22]:
df.head(2)

     Name Age Semester Sex
0  Andrew  18        7   1
1  Philip  23        6   1

In [23]:
df.describe()

          Name  Age  Semester  Sex
count        4    4         4    4
unique       4    4         2    2
top     Andrew   18         7    1
freq         1    1         3    3

In [27]:
df_iris = pd.read_csv("./iris.csv")
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [28]:
df_iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [30]:
print(df_iris.value_counts())

sepal.length  sepal.width  petal.length  petal.width  variety
5.8           2.7          5.1           1.9          Virginica    2
4.4           2.9          1.4           0.2          Setosa       1
              3.0          1.3           0.2          Setosa       1
              3.2          1.3           0.2          Setosa       1
4.3           3.0          1.1           0.1          Setosa       1
                                                                  ..
7.7           2.6          6.9           2.3          Virginica    1
              2.8          6.7           2.0          Virginica    1
              3.0          6.1           2.3          Virginica    1
              3.8          6.7           2.2          Virginica    1
7.9           3.8          6.4           2.0          Virginica    1
Name: count, Length: 149, dtype: int64